<?php

namespace App\Http\Controllers;
use Illuminate\Http\Request;
use Inertia\Inertia;


class ProductController extends Controller
{

    private $products = [
        ['id' => 1, 'name' => ' แก้วน้องวัว', 'description' => 'แก้วเซรามิคลายวัว ขาว-ดำ แก้วเซรามิคมีความแข็งแรง ทนทานต่อการใช้งานในระยะยาว และมักมาพร้อมกับดีไซน์ที่หลากหลาย
        สวยงาม เหมาะสำหรับการใช้งานหรือสะสม และยังเป็นมิตรต่อสิ่งแวดล้อม เพราะสามารถนำกลับมาใช้ใหม่ได้ ลดการใช้แก้วพลาสติกแบบใช้ครั้งเดียวทิ้ง ',
         'price' => 4, 'image' => '/images/kaew1.jpg'],
        ['id' => 2, 'name' => 'แก้วแมวฟ้า', 'description' => 'แก้วเซรามิคลายดอกไม้สีฟ้า มีตัวนูนน้องแมวเทาส้มโผล่หน้าขึ้นมาในแก้ว แก้วเซรามิคมีความแข็งแรง ทนทานต่อการใช้งานในระยะยาว
        และมักมาพร้อมกับดีไซน์ที่หลากหลาย สวยงาม เหมาะสำหรับการใช้งานหรือสะสม และยังเป็นมิตรต่อสิ่งแวดล้อม เพราะสามารถนำกลับมาใช้ใหม่ได้ ลดการใช้แก้วพลาสติกแบบใช้ครั้งเดียวทิ้ง',
         'price' => 6, 'image' => '/images/kaew3.jpg'],
        ['id' => 3, 'name' => 'แก้วแมวเขียว', 'description' => 'แก้วเซรามิคลายดอกไม้สีเขียว มีตัวนูนน้องแมวเทาส้มโผล่หน้าขึ้นมาในแก้วและหูจับ แก้วเซรามิคมีความแข็งแรง
        ทนทานต่อการใช้งานในระยะยาว และมักมาพร้อมกับดีไซน์ที่หลากหลาย สวยงาม เหมาะสำหรับการใช้งานหรือสะสม และยังเป็นมิตรต่อสิ่งแวดล้อม เพราะสามารถนำกลับมาใช้ใหม่ได้ ลดการใช้แก้วพลาสติกแบบใช้ครั้งเดียวทิ้ง',
         'price' => 6, 'image' => '/images/kaew4.jpg'],
        ['id' => 4, 'name' => 'แก้วน้องหมา', 'description' => 'แก้วเซรามิคน้องหมาคอร์กี้ใส่ชุดสีเทา แก้วเซรามิคมีความแข็งแรง ทนทานต่อการใช้งานในระยะยาว และมักมาพร้อมกับดีไซน์ที่หลากหลาย
        สวยงาม เหมาะสำหรับการใช้งานหรือสะสม และยังเป็นมิตรต่อสิ่งแวดล้อม เพราะสามารถนำกลับมาใช้ใหม่ได้ ลดการใช้แก้วพลาสติกแบบใช้ครั้งเดียวทิ้ง',
         'price' => 5, 'image' => '/images/kaew5.jpg'],
        ['id' => 5, 'name' => 'แก้วขนมปัง', 'description' => 'แก้วเซรามิครูปขนมปังมีไข่ดาวบนหัว พร้อมฝาปิดที่มีน้องขนมปังตัวนูนอยู่กลางฝา แก้วเซรามิคมีความแข็งแรง
        ทนทานต่อการใช้งานในระยะยาว และมักมาพร้อมกับดีไซน์ที่หลากหลาย สวยงาม เหมาะสำหรับการใช้งานหรือสะสม และยังเป็นมิตรต่อสิ่งแวดล้อม เพราะสามารถนำกลับมาใช้ใหม่ได้ ลดการใช้แก้วพลาสติกแบบใช้ครั้งเดียวทิ้ง',
         'price' => 7, 'image' => '/images/kaew6.jpg'],
        ['id' => 6, 'name' => 'แก้วหมูอู๊ด', 'description' => 'แก้วเซรามิครูปลูกพีชสีชมพู พร้อมฝาปิดที่มีน้องหมูตัวนูนกลางแก้ว และช้อน แก้วเซรามิคมีความแข็งแรง ทนทานต่อการใช้งานในระยะยาว และมักมาพร้อมกับดีไซน์ที่หลากหลาย
         สวยงาม เหมาะสำหรับการใช้งานหรือสะสม และยังเป็นมิตรต่อสิ่งแวดล้อม เพราะสามารถนำกลับมาใช้ใหม่ได้ ลดการใช้แก้วพลาสติกแบบใช้ครั้งเดียวทิ้ง',
         'price' => 8, 'image' => '/images/kaew7.jpg'],
        ['id' => 7, 'name' => 'จานลายดอกไม้', 'description' => 'จานเซรามิครูปดอกไม้ ทนต่อความร้อนและความเย็นได้ดี ทำให้สามารถใช้งานได้ทั้งในไมโครเวฟและเตาอบ
        อีกทั้งยังปลอดภัยต่อสุขภาพ ไม่มีสารอันตรายปนเปื้อนในอาหาร และยังเป็นมิตรต่อสิ่งแวดล้อม เนื่องจากใช้ซ้ำได้และลดการใช้จานพลาสติกแบบใช้ครั้งเดียวทิ้ง',
         'price' => 3, 'image' => '/images/jan5.jpg'],
        ['id' => 8, 'name' => 'จานเชฟแมว', 'description' => 'จานเซรามิครูปน้องแมวใส่ชุดเชฟพร้อมกับมีหัวแมวนูน ทนต่อความร้อนและความเย็นได้ดี ทำให้สามารถใช้งานได้ทั้งในไมโครเวฟและเตาอบ
        อีกทั้งยังปลอดภัยต่อสุขภาพ ไม่มีสารอันตรายปนเปื้อนในอาหาร และยังเป็นมิตรต่อสิ่งแวดล้อม เนื่องจากใช้ซ้ำได้และลดการใช้จานพลาสติกแบบใช้ครั้งเดียวทิ้ง',
         'price' => 3, 'image' => '/images/jan6.jpg'],
        ['id' => 9, 'name' => 'จานหมาคริสมาสต์', 'description' => 'จานเซรามิครูปน้องหมาอุ้มแมวที่อยู่บนกล่องของขวัญ ทนต่อความร้อนและความเย็นได้ดี ทำให้สามารถใช้งานได้ทั้งในไมโครเวฟและเตาอบ
         อีกทั้งยังปลอดภัยต่อสุขภาพ ไม่มีสารอันตรายปนเปื้อนในอาหาร และยังเป็นมิตรต่อสิ่งแวดล้อม เนื่องจากใช้ซ้ำได้และลดการใช้จานพลาสติกแบบใช้ครั้งเดียวทิ้ง',
         'price' => 3, 'image' => '/images/jan7.jpg'],
        ['id' => 10, 'name' => 'จานแซนต้าฟ้า', 'description' => 'จานเซรามิคซานต้าใส่ชุดสีฟ้าและลายจุด ทนต่อความร้อนและความเย็นได้ดี ทำให้สามารถใช้งานได้ทั้งในไมโครเวฟและเตาอบ
         อีกทั้งยังปลอดภัยต่อสุขภาพ ไม่มีสารอันตรายปนเปื้อนในอาหาร และยังเป็นมิตรต่อสิ่งแวดล้อม เนื่องจากใช้ซ้ำได้และลดการใช้จานพลาสติกแบบใช้ครั้งเดียวทิ้ง',
         'price' => 3, 'image' => '/images/jan8.jpg'],
        ['id' => 11, 'name' => 'จานหมีอ้วน', 'description' => 'จานเซรามิคที่เป็นรูปทรงน้องหมีตัวอ้วนวงกลม มีหน้านูน ทนต่อความร้อนและความเย็นได้ดี ทำให้สามารถใช้งานได้ทั้งในไมโครเวฟและเตาอบ
         อีกทั้งยังปลอดภัยต่อสุขภาพ ไม่มีสารอันตรายปนเปื้อนในอาหาร และยังเป็นมิตรต่อสิ่งแวดล้อม เนื่องจากใช้ซ้ำได้และลดการใช้จานพลาสติกแบบใช้ครั้งเดียวทิ้ง',
         'price' => 4, 'image' => '/images/jan9.jpg'],
        ['id' => 12, 'name' => 'จานสโนว์แมน', 'description' => 'จานเซรามิคลายสโนว์แมนอ้วนกลมใส่หมวกคริสมาสต์ ทนต่อความร้อนและความเย็นได้ดี ทำให้สามารถใช้งานได้ทั้งในไมโครเวฟและเตาอบ
        อีกทั้งยังปลอดภัยต่อสุขภาพ ไม่มีสารอันตรายปนเปื้อนในอาหาร และยังเป็นมิตรต่อสิ่งแวดล้อม เนื่องจากใช้ซ้ำได้และลดการใช้จานพลาสติกแบบใช้ครั้งเดียวทิ้ง',
         'price' => 5, 'image' => '/images/jan10.jpg'],

        ];





    /**
     * Display a listing of the resource.
     */
    public function index()
    {
        return Inertia::render('Products/Index', ['products' =>
        $this->products]);
    }

    /**
     * Show the form for creating a new resource.
     */
    public function create()
    {
        //
    }

    /**
     * Store a newly created resource in storage.
     */
    public function store(Request $request)
    {
        //
    }

    /**
     * Display the specified resource.
     */
    public function show(string $id)
    {
        //
        $product = collect($this->products)->firstWhere('id', $id);

        if (!$product) {
        abort(404, 'Product not found');
    }
        return Inertia::render('Products/Show', ['product' => $product]);

    }

    /**
     * Show the form for editing the specified resource.
     */
    public function edit(string $id)
    {
        //
    }

    /**
     * Update the specified resource in storage.
     */
    public function update(Request $request, string $id)
    {
        //
    }

    /**
     * Remove the specified resource from storage.
     */
    public function destroy(string $id)
    {
        //
    }

    public function test()
    {
    return Inertia::render('Test');
    }

}
